# Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs
# 核心修改：Head的P3小目标层（第16层）用ACmix替换C3k2

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11n backbone（保持原始结构）
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4（输出通道512，P3 backbone特征）
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]] # 6（输出通道512，P4 backbone特征）
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10（输出通道1024，P5 backbone特征）

# YOLO11n head（核心修改P3层）
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11（上采样层10输出，通道1024）
  - [[-1, 6], 1, Concat, [1]] # 12（拼接层11与层6：1024 + 512 = 1536通道）
  - [-1, 2, C3k2, [512, False]] # 13（输出通道512，P4 head特征）

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14（上采样层13输出，通道512）
  - [[-1, 4], 1, Concat, [1]] # 15（拼接层14与层4：512 + 512 = 1024通道，P3融合特征）
  # 核心修改：P3小目标层用ACmix替换C3k2，输入1024→输出256（匹配后续层）
  - [-1, 1, ACmix, [1024, 256, 5, 2, 3, 1]] # 16（P3/8-small，替换原C3k2[256, False]）

  - [-1, 1, Conv, [256, 3, 2]] # 17（输入256，输出256，下采样P3特征）
  - [[-1, 13], 1, Concat, [1]] # 18（拼接层17与层13：256 + 512 = 768通道）
  - [-1, 2, C3k2, [512, False]] # 19（P4/16-medium，保持原模块）

  - [-1, 1, Conv, [512, 3, 2]] # 20（输入512，输出512，下采样P4特征）
  - [[-1, 10], 1, Concat, [1]] # 21（拼接层20与层10：512 + 1024 = 1536通道）
  - [-1, 2, C3k2, [1024, True]] # 22（P5/32-large，保持原模块）

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)
